package com.mzdxztm.ztm.library;

/**
 * 笔记
 */
public class Note {

    /**
     * 疑难问题：
     *
     * 1、firefox与chrome找不到朗读和页翻译插件
     * 2、如何抓包
     * 3、翻墙问题
     * 4、如何打开权限页面（分手机品牌）
     * 5、下拉刷新
     * 6、即使通讯（相关协议的理解，聊天界面的相关功能，单聊和群聊）
     */

    /**
     * 要掌握的知识点：
     *
     * 1、列表优化
     * （1）拆分数据实体,实现复杂布局（QQ空间、商品详情、搜索筛选）
     * （2）展开收缩列表（包括半展开半收缩）
     * （3）列表图片优化（快速滑动不加载，必要时只加载缩略图）
     * （4）可收缩头部（可忽略）
     *
     * 2、自己的一套内存泄露方法（不用pro file）
     * （1）注意常出现的内存泄露
     * （2）查看占大内存对象
     * （3）几种引用的使用（如：强引用，弱引用）
     *
     * 3、工具
     * (1)git涉及的概念（如分支、add等）
     * (2)版本控制涉及到的概念及其操作（git上的操作）
     *（3）github与android studio更新下载问题
     *
     * 4、常用第三方
     *  （1）微信、支付宝支付及其常用的几种支付方式
     *  （2）银行卡支付
     *  （3）百度地图、高德地图（定位，集中地图类型、地图覆盖物、鹰眼、坐标转换）
     *  （4）推送及其原理（极光推送）
     *  （5）第三方登陆与分享（如：友盟。说明：有收藏功能可以收藏，如微信。）
     *  （6）云存储（bmob，阿里云oss等）
     *
     */
}
