package com.mzdxztm.ztm.library;

/**
 * 笔记
 */
public class Note {

    /**
     * 疑难问题：
     *
     * 1、firefox与chrome找不到朗读和页翻译插件
     * 2、如何抓包
     *
     *
     */

    /**
     * 要掌握的知识点：
     *
     * 1、列表优化
     * （1）拆分数据实体,实现复杂布局（QQ空间、商品详情、搜索筛选）
     * （2）展开收缩列表（包括半展开半收缩）
     * （3）列表图片优化（快速滑动不加载，必要时只加载缩略图）
     * （4）可收缩头部（可忽略）
     *
     * 2、自己的一套内存泄露方法（不用pro file）
     * （1）注意常出现的内存泄露
     * （2）查看占大内存对象
     * （3）几种引用的使用（如：强引用，弱引用）
     *
     * 3、工具
     * (1)git涉及的概念（如分支、add等）
     * (2)版本控制涉及到的概念及其操作（git上的操作）
     *（3）github与android studio更新下载问题
     *
     *
     */

}
